Repository: iiiiii1wepfj/telegram-bundle
Catalog: Resources/translations/messages.*.xlf
Languages: ru

# general.account_blocked
source: Sorry, your account is blocked.
ru: Извините, ваш аккаунт заблокирован.

# command.private_only
source: This command works only in the private chat with the bot.
ru: Эта команда работает только в личной переписке с ботом.

source: Command cancelled.
ru: Команда отменена.

# command.input_obsolete
source: Input outdated. Submit the command again, please.
ru: Ввод данных устарел. Отправьте команду заново, пожалуйста.

# command.unknown
source: Sorry, unknown command.
ru: Извините, такой команды я не знаю.

# command.forbidden
source: Sorry, this command is forbidden.
ru: Извините, у вас недостаточно прав для доступа к этой команде.

# command.button.cancel
source: Cancel
ru: Отмена

# command.option.yes
source: Yes
ru: Да

# command.option.no
source: No
ru: Нет

# command.start.description
source: Start chat with bot
ru: Начать разговор с ботом

# command.help.description
source: Show bot commands
ru: Показать список команд бота

# command.listroles.description
source: Show list of roles & permissions
ru: Показать список ролей и разрешений

# command.push.description
source: Send mass notification message
ru: Отправить широковещательное уведомление

# command.register.description
source: Sign in
ru: Зарегистрироваться у бота

# command.settings.description
source: Bot settings
ru: Настройки бота

# command.userman.description
source: Manage users roles
ru: Управление ролями пользователей

# command.start.welcome
source: Hi! To see list of available commands use /help
ru: Привет! Список команд доступен по команде /help

# command.help.list_of_commands
source: List of bot commands:
ru: Список команд бота:

# command.listroles.list_of_roles
source: List of roles & permissions:
ru: Список ролей и разрешений:

# command.listroles.roles_undefined
source: Roles are not defined.
ru: Роли в системе не определены.

# command.push.send_text
source: Send me text of the notification, please.
ru: Отправьте мне текст для рассылки, пожалуйста.

# command.push.empty_text
source: You sent me empty message. Please try again /push
ru: Вы отправили мне пустое сообщение. Начните заново /push

# command.push.text_too_long
source: Text exceeds allowed length of 4096 symbols: %text_length% symbols. Please try again /push
ru: Текст длиннее предельно допустимой длины в 4096 символов: %text_length% символов. Начните заново /push

# command.push.choose_channel
source: Which notification channel to use?
ru: В какой канал высылаем сообщение?

# command.push.text_lost
source: Notification text was lost. Please try again /push
ru: Текст для рассылки потерялся. Начните заново /push

# command.push.channel_name_empty
source: Channel name is empty. Please try again /push
ru: Название канала рассылки пустое. Начните заново /push

# command.push.channel_name_invalid
source: Invalid channel name. Please select one from the list.
ru: Некорректное название канала рассылки. Выберите из списка ещё раз.

# command.push.cancelled
source: Push cancelled.
ru: Рассылка отменена.

# command.push.confirmation_message
source: Please check everything is correct below. <b>Channel:</b> %channel_caption% (%channel_name%) <b>Length:</b> %text_length% symbols <b>Text:</b>
ru: Подтвердите корректность указанной ниже информации. <b>Канал:</b> %channel_caption% (%channel_name%) <b>Длина:</b> %text_length% символов <b>Текст:</b>

# command.push.confirmation_instructions
source: If everything is OK, type in CAPITAL LETTERS text "PUSH CONFIRMED". Any other text will cancel operation.
ru: Если всё правильно, напишите мне ЗАГЛАВНЫМИ БУКВАМИ текст «рассылку подтверждаю». Любой другой текст отменяет рассылку.

# command.push.something_went_wrong
source: Something went wrong. Please try again /push
ru: Что-то пошло не так. Начните заново /push

# command.push.confirmation
source: PUSH CONFIRMED
ru: РАССЫЛКУ ПОДТВЕРЖДАЮ

# command.push.notification_sent
source: Push to the channel «%channel_caption%» confirmed and sent (%text_length% symbols).
ru: Рассылка в канал «%channel_caption%» подтверждена и выслана (%text_length% символов).

# command.register.send_phone
source: Send phone number
ru: Сообщить номер телефона

# command.register.send_instruction
source: To sign you in, I need your phone number. Please send me your contact by pressing the button "Send phone number" and confirm the dialog.
ru: Чтобы зарегистрироваться, мне нужно узнать ваш телефон. Пришлите мне его, нажав кнопку «Сообщить номер телефона» и подтвердите своё согласие.

# command.register.not_your_phone
source: You sent me not your contact. Please try again /register
ru: Вы прислали не свой номер телефона! Попробуйте ещё раз /register

# command.register.success
source: You successfully signed in with the phone number %phone_number%. Now you have access to commands for registered users, please check the list with /help
ru: Вы зарегистрированы с номером телефона %phone_number%. Теперь у вас есть доступ к командам для зарегистрированных пользователей, проверьте их список по команде /help'

# command.register.not_contact
source: You sent me phone number typed with hands. I need you to press <b>special button "Send phone number"</b>. Please, try again.
ru: Вы прислали мне номер телефона, набранный на клавиатуре. Мне надо, чтобы вы нажали <b>специальную кнопку «Сообщить номер телефона»</b>. Пожалуйста, попробуйте ещё раз?

# command.register.invalid_number
source: You sent me something weird. Please try again /register
ru: Вы прислали не телефон, а что-то, мне непонятное. Попробуйте ещё раз команду /register

# command.settings.notification.self_update
source: Bot news
ru: Что нового в боте

# command.settings.notification.new_registration
source: New registrations
ru: Новые регистрации

# command.userman.add_roles
source: Add roles
ru: Добавить роли

# command.userman.remove_roles
source: Remove roles
ru: Убрать роли

# command.userman.flip_blocking
source: Flip blocking status
ru: Изменить блокировку

# command.userman.specify_search_string
source: Specify part of name, username or phone:
ru: Укажите часть ФИО, никнейма либо номер телефона:

# command.userman.request_min_count_length
source: Search substring should be at least 3 characters length.
ru: Запрос должен содержать минимум 3 символа.

# command.userman.no_users_found
source: I did not find any users that meet these criteria.
ru: Не нашёл ни одного пользователя, удовлетворяющего этим критериями.

# command.userman.multiple_users_found
source: Found several users (%users_count%, если быть точным), that meet these criteria. Please, be more specific so only 1 should be found.
ru: Нашёл нескольких пользователей (%users_count%, если быть точным), удовлетворяющих этим критериями. Пожалуйста, уточните запрос так, чтобы был найден только один.

# command.userman.user_info
source: <b>%full_name%</b> External name: %full_external_name% Username: @%username% Phone: %phone_number% Telegram ID: %telegram_id% Blocked: %blocking_status% <b>Roles:</b>
ru: <b>%full_name%</b> В миру: %full_external_name% Никнейм: @%username% Телефон: %phone_number% Telegram ID: %telegram_id% Заблокирован: %blocking_status% <b>Роли:</b>

# command.userman.select_role_to_add
source: Which role add to user?
ru: Какую роль добавить пользователю?

# command.userman.select_role_to_remove
source: Which role remove from user?
ru: Какую роль убрать у пользователя?

# command.userman.invalid_option
source: Invalid option. Please try again /userman
ru: Команда непонятна. Попробуйте еще раз /userman

# command.userman.user_not_found
source: User not found :(
ru: Пользователь не найден :(

# command.userman.blocking_status_changed
source: Blocking status changed.
ru: Статус блокровки изменён.

# command.userman.role_not_found
source: Role "%role_name%" not found in the list
ru: Роль не найдена в списке: %role_name%

# command.userman.role_added
source: Role added.
ru: Роль добавлена.

# command.userman.role_removed
source: Role removed.
ru: Роль убрана.

# menu.notifications.select
source: Select notifications you want to receive:
ru: Отметьте уведомления, которые хотите получать:

# menu.notifications.settings_saved
source: Notification settings updated.
ru: Настройки уведомлений изменены.
